<a href="https://colab.research.google.com/github/Safhanafarha775/DataScience-Journey/blob/main/DS_Project2_PandasBasics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Step 1 : Create a small DataFrame

In [4]:
import pandas as pd

In [5]:
data= {"Name":["Ali","Sara","John"],"Age":[25,30,22],"City":["Delhi","Mumbai","Chennai"]}
df=pd.DataFrame(data)
print("Initial DataFrame : ",df)

Initial DataFrame :     Name  Age     City
0   Ali   25    Delhi
1  Sara   30   Mumbai
2  John   22  Chennai

Step 2 : Add New Column

In [7]:
df["Salary"]=[50000,38000,42000]
print("\n After adding Salary Column : ")
print(df)

 After adding Salary Column :
   Name  Age     City  Salary
0   Ali   25    Delhi   50000
1  Sara   30   Mumbai   38000
2  John   22  Chennai   42000

Step 3 : Update one row [Change age of john to 23]

In [8]:
df.loc[df["Name"]=="John","Age"]=23
print("\n After updating Age of John : ")
print(df)

 After updating Age of John :
   Name  Age     City  Salary
0   Ali   25    Delhi   50000
1  Sara   30   Mumbai   38000
2  John   23  Chennai   42000

Step 4 : delete one Column City

In [11]:
df=df.drop("City",axis=1)
print(df)

   Name  Age  Salary
0   Ali   25   50000
1  Sara   30   38000
2  John   23   42000